In [1]:
import pandas as pd

df = pd.read_csv("Iris.csv")
print(df.head())

   Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
0   1            5.1           3.5            1.4           0.2  Iris-setosa
1   2            4.9           3.0            1.4           0.2  Iris-setosa
2   3            4.7           3.2            1.3           0.2  Iris-setosa
3   4            4.6           3.1            1.5           0.2  Iris-setosa
4   5            5.0           3.6            1.4           0.2  Iris-setosa

In [2]:
df.iloc[:5]

   Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
0   1            5.1           3.5            1.4           0.2  Iris-setosa
1   2            4.9           3.0            1.4           0.2  Iris-setosa
2   3            4.7           3.2            1.3           0.2  Iris-setosa
3   4            4.6           3.1            1.5           0.2  Iris-setosa
4   5            5.0           3.6            1.4           0.2  Iris-setosa

In [3]:
df = pd.read_csv("Iris.csv",sep = '\t')
print(df.head())

  Id,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm,Species
0                      1,5.1,3.5,1.4,0.2,Iris-setosa
1                      2,4.9,3.0,1.4,0.2,Iris-setosa
2                      3,4.7,3.2,1.3,0.2,Iris-setosa
3                      4,4.6,3.1,1.5,0.2,Iris-setosa
4                      5,5.0,3.6,1.4,0.2,Iris-setosa

In [4]:
df = pd.read_csv("Iris.csv",delim_whitespace=True)
df.head()

C:\Users\ADMIN\AppData\Local\Temp\ipykernel_17292\681731644.py:1: FutureWarning: The 'delim_whitespace' keyword in pd.read_csv is deprecated and will be removed in a future version. Use ``sep='\s+'`` instead
  df = pd.read_csv("Iris.csv",delim_whitespace=True)

  Id,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm,Species
0                      1,5.1,3.5,1.4,0.2,Iris-setosa
1                      2,4.9,3.0,1.4,0.2,Iris-setosa
2                      3,4.7,3.2,1.3,0.2,Iris-setosa
3                      4,4.6,3.1,1.5,0.2,Iris-setosa
4                      5,5.0,3.6,1.4,0.2,Iris-setosa

# Download JSON dataset

In [5]:
data = pd.read_json("salaries.json")
data.head()

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2024,SE,FT,Data Scientist,235400,USD,235400,US,0,US,M
1,2024,SE,FT,Data Scientist,212109,USD,212109,US,0,US,M
2,2024,SE,FT,Research Engineer,251000,USD,251000,US,0,US,M
3,2024,SE,FT,Research Engineer,177008,USD,177008,US,0,US,M
4,2024,SE,FT,Data Engineer,196900,USD,196900,US,100,US,M

# SQL

In [6]:
# # SQL Data Imports
# import sqlite3 as sql
# import pandas as pd

# path = 'ConsumerComplaints.csv'

# # Create connection to SQL database
# con = sql.Connection(path)

# # Write SQL query
# query = '''SELECT * FROM Issue'''

# # Execute
# data = pd.read_sql(query,con)